<?php
/*actions*/
$l['delete'] = 'Удалить';
$l['update'] = 'Обновить';
$l['edit'] = 'Изменить';
$l['all_selected_pages'] = 'Все отмеченные страницы';
$l['add_more'] = 'Добавить еще';
$l['show'] = 'Показать';
$l['hide'] = 'Скрыть';
$l['save'] = 'Сохранить';
$l['view'] = 'Обзор';
$l['not_writeable'] = 'Не доступно для записи';
$l['show_or_hide'] = 'Скрыть или Показать';
$l['check_all'] = 'Отметить все';
$l['recover'] = 'Восстановить';
/*main*/
$l['admin'] = 'Админка';
$l['to_site'] = 'Перейти на сайт';
$l['content'] = 'Контент';
$l['modules'] = 'Модули';
$l['settings'] = 'Настройки';
$l['exit'] = 'Выход';
$l['configuration'] = 'Общие данные';
$l['template'] = 'Шаблон';
$l['iblocks'] = 'Инфоблоки';
$l['access_log'] = 'Лог входов';
$l['license'] = 'распространяется по лицензии GNU/GPL';
$l['welcome'] = 'Добро пожаловать! Снова.';
$l['login'] = 'Логин';
$l['password'] = 'Пароль';
$l['signup'] = 'Войти';
$l['status'] = 'Статус';
$l['hidden'] = 'Скрыта';
$l['visible'] = 'Видима';
$l['trash'] = 'Корзина';
$l['add_type'] = 'добавить раздел';
$l['date'] = 'Дата';
$l['comment'] = 'Комментарий';
$l['log_in'] = 'Вход';
$l['site_title_empty'] = 'Добавьте site_title в "Дополнительные данные" в настройках';
/*messages*/
$l['unauthorized_request'] = 'Несанкционированный запрос';
$l['no_value'] = 'Не передано значение';
$l['restricted'] = 'Нет доступа';
$l['deleted'] = 'Удалено';
$l['not_deleted'] = 'Не получилось удалить<br>Произошла ошибка';
$l['saved'] = 'Сохранено';
$l['error_not_saved'] = 'Не получилось сохранить<br>Произошла ошибка';
$l['folder_created'] = 'Папка создана';
$l['folder_not_created'] = 'Не удалось создать папку';
$l['folder_not_deleted'] = 'Не удалось удалить папку. Возможно, она не пустая';
$l['db_not_open'] = 'Не удалось открыть базу данных';
$l['no_table_created'] = 'Невозможно создать таблицу в базе данных';
$l['file_not_exist'] = 'Файл не существует';
$l['file_empty'] = 'Файл пуст';
$l['already_exists'] = 'Такое уже существует';
$l['success'] = 'Все шикарно!';
$l['module_installed'] = 'Модуль установлен';
/*mod pages*/
$l['yet_empty'] = 'Пока пусто. Но можно добавить, нажав на [+1].';
$l['page_title'] = 'Заголовок';
$l['link'] = 'Ссылка';
$l['actions'] = 'Действия';
$l['not_saved'] = 'Страница<br>не сохранена';
$l['parent'] = 'Родитель';
$l['editor'] = 'Редактирование';
$l['page_alias'] = 'Алиас страницы';
$l['page_content'] = 'Контент страницы';
$l['root'] = 'Корень';
$l['show_all_pages'] = 'Показать все страницы?';
$l['view_page'] = 'Посмотреть<br>на сайте';
$l['hide_page'] = 'Скрыть страницу';
$l['show_page'] = 'Сделать видимой';
$l['clear_cache'] = 'Удалить <br>из кэша';
$l['not_cached'] = 'Нет в<br>кеше';
$l['no_translation'] = 'Нет перевода';
/* system modules */
$l['iblock_list'] = 'Список инфоблоков';
$l['add_iblock'] = 'Нажми, что бы добавить новый инфо-блок';
$l['insert_title'] = 'А теперь введи его название и нажми Enter чтобы сохранить';
$l['epmty'] = 'Тут пока пусто';
$l['other_files'] = 'Другие файлы';
$l['developer_code'] = 'Код разработчика';
$l['site'] = 'Сайт';
$l['site_work'] = 'Сайт работает?';
$l['site_location'] = 'Расположение сайта';
$l['site_template'] = 'Шаблон сайта';
$l['admin_ip'] = 'Если сайт выключен, доступ только этим IP';
$l['maintenance'] = 'Если сайт выключен, пользователям сказать';
$l['locales'] = 'Языки страниц';
$l['auto_login'] = 'Включить авто-логин?';
$l['admin_login'] = 'Логин администратора';
$l['new_pass'] = 'Новый пароль';
$l['new_developer_code'] = 'Новый код разработчика';
$l['final_template'] = 'Шаблоны страниц, скрытых в меню "Родитель"';
$l['pages'] = 'Cтраницы';
$l['your_ip'] = 'Ваш IP:';
$l['type'] = 'Тип страницы';
$l['name'] = 'Название в меню';
$l['default_template'] = 'Шаблон по умолчанию';
$l['need_cache'] = 'Включить кэширование';
/*meta plugin*/
$l['meta_data'] = 'Дополнительные данные';
$l['meta_tip'] = "Выберите ключ из списка или введите новый\nВ шаблоне выводится через {meta:ключ}";
$l['meta_key'] = 'Ключ';
$l['meta_value'] = 'Значение';
$l['add'] = 'Добавить';
$l['exist_keys'] = 'Существующие ключи';
/*tips*/
$l['tip_alias'] = "Псевдоним, для создания ссылки\nМожно использовать символы a-z0-9-_\nЕсли оставить пустым, автоматически заполнится транслитом от заголовка";
$l['tip_title'] = 'Пара слов';
$l['click_to_show'] = 'Нажми, что бы показать';
$l['tip_developer_code'] = "Этот код нужен, что бы хацкеры не редактировали файлы и настройки, если вдруг попадут в админку\nСохраняется только на 1 сессию";
$l['tip_final_template'] = 'Страницы, использующие данные шаблоны, не видны в списке родителей. Вводите через пробел';
$l['tip_enter_with_spacebar'] = 'Вводите через пробел';
$l['tip_locales'] = "Вводите через пробел двубуквенные\nкоды языков: en ru de it";

//translit and clean the string
function properUri($str){
	if(preg_match('![^\w-]!', $str)){
		$tr = array(
			'А'=>'a','Б'=>'b','В'=>'v','Г'=>'g','Д'=>'d','Е'=>'e','Ж'=>'j','З'=>'z','И'=>'i','Й'=>'y','К'=>'k',
			'Л'=>'l','М'=>'m','Н'=>'n','О'=>'o','П'=>'p','Р'=>'r','С'=>'s','Т'=>'t','У'=>'u','Ф'=>'f','Х'=>'h',
			'Ц'=>'ts','Ч'=>'ch','Ш'=>'sh','Щ'=>'sch','Ъ'=>'','Ы'=>'yi','Ь'=>'','Э'=>'e','Ю'=>'yu','Я'=>'ya',
			'а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ж'=>'j','з'=>'z','и'=>'i','й'=>'y','к'=>'k',
			'л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'h',
			'ц'=>'ts','ч'=>'ch','ш'=>'sh','щ'=>'sch','ъ'=>'y','ы'=>'yi','ь'=>'','э'=>'e','ю'=>'yu','я'=>'ya',
			' '=>'_','*'=>'-'
		);
		$str = strtr($str,$tr);
		$str = preg_replace('![^\w-]!', '', $str);
	}
	return $str;
}
?>